src/cf/InformationRegisters/КатегорииНовостейПростыеНеобработанные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КатегорииНовостейПростыеНеобработанные</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УсловиеОтбора</Name>
					<Comment>Значения: eq ne lt le gt ge</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>КатегорияНовостейСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗначениеКатегорииНовостейСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛентаНовостей</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛентыНовостей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИННовости</Name>
					<Comment>Уменьшено с 255 до 240, чтобы общая длина индекса не превышала 900 байт (ограничение MS SQL Server)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/КатегорииНовостейПростыеНеобработанные/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Возвращает структуру полей записи этого регистра сведений.
//
// Возвращаемое значение:
//   Структура - структура с ключами, повторяющими все измерения, ресурсы и реквизиты.
//
Функция НовыйОписательЗаписи() Экспорт

	Результат = Новый Структура;
		Результат.Вставить("КатегорияНовостейСтрока", ""); // Строка (100)
		Результат.Вставить("ЗначениеКатегорииНовостейСтрока", ""); // Строка (100)
		Результат.Вставить("ЛентаНовостей"          , Справочники.ЛентыНовостей.ПустаяСсылка());
		Результат.Вставить("УИННовости"             , ""); // Строка (240) // Уменьшено с 255 до 240, чтобы общая длина индекса не превышала 900 байт (ограничение MS SQL Server)
		Результат.Вставить("УсловиеОтбора"          , ""); // Строка (2)

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
